evidence/qwen38-27b-v1.0/gx10-01-xxj/20260902-20260903/raw/benchmarks-raw/local-llm-cross-platform-benchmark/qwen38-27b-v1.0/gx10-single/B0_calibration/nvfp4/aborted-gpu-memory-utilization-085/warmup.log.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xe79ee64bbb00>, trust_remote_code=False, seed=20260831, num_prompts=1, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://<IP_REDACTED>:8000', host='<IP_REDACTED>', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='qwen38-27b-nvfp4-b0', input_len=32768, output_len=256, tokenizer='$HOME/xxj/models/original/qwen3.8-27b/nvfp4/9e3d73c76eddb75f795cc24ccfbc5affe41c66bd', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='$HOME/xxj/benchmarks/raw/local-llm-cross-platform-benchmark/qwen38-27b-v1.0/gx10-single/B0_calibration/nvfp4', result_filename='warmup.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-c31cf057-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-31 15:47:56 [utils.py:90] Sampling input_len from [32768, 32768] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1

  0%|          | 0/1 [00:00<?, ?it/s]
100%|██████████| 1/1 [00:00<00:00,  1.52it/s]
100%|██████████| 1/1 [00:00<00:00,  1.52it/s]
$HOME/xxj/venvs/local-llm-benchmark-vllm-0.28.0/lib/python3.12/site-packages/vllm/benchmarks/serve.py:1152: UserWarning: All requests failed. This is likely due to a misconfiguration on the benchmark arguments.
  metrics, actual_output_lens = calculate_metrics(
Failed requests during benchmark run detected (capping to 10):
Error 0: Bad Gateway
============ Serving Benchmark Result ============
Successful requests:                     0         
Failed requests:                         1         
Maximum request concurrency:             1         
Benchmark duration (s):                  0.66      
Total input tokens:                      0         
Total generated tokens:                  0         
Request throughput (req/s):              0.00      
Output token throughput (tok/s):         0.00      
Peak output token throughput (tok/s):    0.00      
Peak concurrent requests:                0.00      
Total token throughput (tok/s):          0.00      
---------------Time to First Token----------------
Mean TTFT (ms):                          0.00      
Median TTFT (ms):                        0.00      
P50 TTFT (ms):                           0.00      
P90 TTFT (ms):                           0.00      
P99 TTFT (ms):                           0.00      
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P50 TPOT (ms):                           0.00      
P90 TPOT (ms):                           0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P50 ITL (ms):                            0.00      
P90 ITL (ms):                            0.00      
P99 ITL (ms):                            0.00      
----------------End-to-end Latency----------------
Mean E2EL (ms):                          0.00      
Median E2EL (ms):                        0.00      
P50 E2EL (ms):                           0.00      
P90 E2EL (ms):                           0.00      
P99 E2EL (ms):                           0.00      
==================================================